app/controllers/records_controller.rb

INSERT INTO "records" ("date", "title", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "asdf"], ["title", "asd"], ["amount", 123132], ["created_at", 2016-07-16 03:16:55 UTC], ["updated_at", 2016-07-16 03:16:55 UTC]]
---
  def create
	@record = Record.new(record_params)
	if @record.save

DELETE FROM "records" WHERE "records"."id" = $1  [["id", 2]]
---
  def destroy
  	Record.destroy(params[:id])

SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "records" SET "title" = $1, "date" = $2, "updated_at" = $3 WHERE "records"."id" = $4  [["title", "Beefi"], ["date", Sat, 16 Jul 2016], ["updated_at", 2016-07-16 08:40:38 UTC], ["id", 11]]
---
  def update
	@record=Record.find(params[:id])
	@record.update_attributes(record_params)